docs/posts/2015-01-13-search-and-replace-with-regular-expressions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Search and Replace with Regular Expressions</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Search and Replace with Regular Expressions</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I wrote the post that follows below so that I could remember how to use regular expressions for search and replace operations in Sublime Text. Since I just now made some headway in Emacs, I&rsquo;ll repost with some updates, again, primarily as a reference for myself.
</p>

<p>
There is no doubt that regular expressions are very powerful. I&rsquo;ve found that the documentation for regular expressions is often as mysterious as the things that the documentation is supposed to explain. Keeping in mind that I am certainly no expert, learning even a little about the use of regular expressions can be quite valuable.
</p>

<p>
The normal search dialogue in text editors will find all uses of the search term. You might not want to find all uses of a term, but only those that match a certain pattern. For example, assume that I want to search for any dates in a long file. If the file contains many different dates, then searching successfully for each one would be tedious, if not impossible. If my dates are in the form &ldquo;YYYY-MM-DD,&rdquo; then I can simply use the regular expression &ldquo;dddd-dd-dd&rdquo;. The &ldquo;d&rdquo; finds a digit, so the search string locates every string of text that consists of four digits, followed by a hyphen, two digits, another hyphen, and ending with two digits.
</p>

<p>
It could be that I wasn&rsquo;t consistent in my dating scheme, some years have all four digits, and others have only two. The year could be first in some cases, but last in others. The search string &ldquo;d&amp;#42;-d&amp;#42;-d&amp;#42;&rdquo; easily handles all of the variations. The asterisk is a repeat operator that matches the preceding character zero or more times. This search will find any three groups of digits separated by hyphens.
</p>

<p>
Search with regular expressions is powerful enough, but replacement is amazing. Any string contained in parentheses can be referenced in both search and replacement strings. That makes it simple to change just part of a string.
</p>

<p>
For example, imagine that I have a list of students that I copied from a database. Each line has the following format, &ldquo;First Last&rdquo;, and I want to change it to &ldquo;Last, First&rdquo;. The following regex search and replace accomplishes the task in one stroke:
</p>


<pre class="example" id="org1649682">
Search: ^(w*) (w*)n
Replace: $2, $1n
</pre>


<p>
This search finds every line consisting of just two words separated by a space. The &lt;code&gt;$1&lt;/code&gt; refers to the string matched by the characters in the first set of parentheses, and &lt;code&gt;$2&lt;/code&gt; refers to the string matched by the second set. The replacement string tells the editor to switch the words and insert a comma between them. This changes a list like this,
</p>


<pre class="example" id="org987e6b6">
George Washington
John Adams
Thomas Jefferson
</pre>


<p>
to
</p>


<pre class="example" id="org968bc92">
Washington, George
Adams, John
Jefferson, Thomas
</pre>


<p>
Imagine how difficult it would be to do this with a long file by cutting and pasting each name! Regular expressions can use Boolean operators, wildcards, and different character types. Different languages have their own particular syntaxes for regular expressions, and I assume that text editors might also have different syntaxes. The examples all work in Sublime Text 2. It&rsquo;s well worth learning a little about how your preferred editor handles regular expressions, it can save a great deal of time and retyping.
</p>

<p>
The primary difference in Emacs is in referencing the strings to be searched for and used in the replace operation. The key is to put a backslash (&ldquo;\&rdquo;) before the opening and closing parentheses in the search operation, and to use a backslash instead of a dollar sign in the replace operation. So, this will work for the preceding example:
</p>


<pre class="example" id="org8c9c21d">
Search: ^\(\w+\) \(\w+\)
Replace: \2, \1
</pre>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
